bootstrap_app/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "yamasaki"], ["memo", "from:kagawa"], ["created_at", "2018-10-08 08:03:06.672336"], ["updated_at", "2018-10-08 08:03:06.672336"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "memo" = ?, "updated_at" = ? WHERE "posts"."id" = ?